from math import log, floor

levels = 1337
marriages = [
    "зеленый", "ситцевый", "бумажный", "кожаный", "льняной",
    "восковый", "деревянный", "чугунный", "рябиновый", "кипарисовый",
    "медный", "жестяной", "маковый", "фыйнсовый", "розовый",
    "янтарный", "оловянный", "стальной", "никелевый", "шелковый",
    "кружевный", "шерстяный", "агатовый ", "стеклянный", "оловянный",
    "бирюзовый", "криптоновый", "фарфоровый", "опаловый", "бронзовый",
    "берилловый", "атласный", "серебряный", "нефритовый", "бархатный",
    "жемчужный", "смуглый", "янтарный", "полотняный", "коралловый",
    "муслиновый", "ртутный", "креповый", "рубиновый", "перламутровый",
    "фланелевый", "топазовый", "сапфировый", "алый", "лавандовый",
    "кашемировый", "аметистовый", "кедровый", "золотый", "изумрудный",
    "бриллиантовый", "платиновый", "железный", "благодатный", "коронный",
    "алебастровый", "дубовый", "красный"
]


def level_name(l):
    base = len(marriages)
    parts = []
    count = floor(log(l, base)) + 1
    c = 0
    n = l
    while n:
        n, r = divmod(n, base)
        word = marriages[r]
        if c != 0:
            word = word.replace('стальной', 'стале-')\
                       .replace('ый', 'о-')\
                       .replace('ой', 'о-')
        c += 1
        parts.append(word)
    return ''.join(reversed(parts))
